spec/sem4r/ad_group_criterion/fixtures/mutate_add_criterion_keyword-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v201101/AdGroupCriterionService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="https://adwords.google.com/api/adwords/cm/v201101" xmlns:s="https://adwords.google.com/api/adwords/cm/v201101">
   <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
         <authToken>***censured***</authToken>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
         <developerToken>***censured***</developerToken>
         <clientEmail>***censured***</clientEmail>
      </s:RequestHeader>
   </env:Header>
   <env:Body>
      <mutate>
         <operations xsi:type="AdGroupCriterionOperation">
            <operator>ADD</operator>
            <operand xsi:type="BiddableAdGroupCriterion">
               <adGroupId>3061162103</adGroupId>
               <criterion xsi:type="Keyword">
                  <text>sem4r adwords api</text>
                  <matchType>BROAD</matchType>
               </criterion>
            </operand>
         </operations>
      </mutate>
   </env:Body>
</env:Envelope>
